In [1]:
import pandas as pd
import numpy as np

### CSV

In [6]:
df = pd.read_csv('example.csv', index_col=1)

In [7]:
df

     a   c   d
b
1    0   2   3
5    4   6   7
9    8  10  11
13  12  14  15

In [4]:
pwd

'C:\\Users\\shrey\\Desktop\\DAPP_Aug2023\\07_Pandas'

In [5]:
ls

 Volume in drive C is Acer
 Volume Serial Number is 30DD-A8A3

 Directory of C:\Users\shrey\Desktop\DAPP_Aug2023\07_Pandas

15-08-2023  19:40    <DIR>          .
10-08-2023  19:31    <DIR>          ..
15-08-2023  19:36    <DIR>          .ipynb_checkpoints
10-08-2023  21:00             8,848 01_Series.ipynb
10-08-2023  21:00           199,179 02_DataFrames.ipynb
11-08-2023  19:33            88,209 03_Conditional_Filtering.ipynb
11-08-2023  20:18           155,853 04_Methods.ipynb
11-08-2023  20:43            44,001 05_Missing_Data.ipynb
14-08-2023  19:50           241,223 06_Groupby Operations.ipynb
14-08-2023  20:41            55,617 07_combining_dataframes.ipynb
15-08-2023  19:35            81,263 08_DateTime.ipynb
15-08-2023  19:40             1,180 09_IP_OP.ipynb
21-06-2023  15:47                51 example.csv
              10 File(s)        875,424 bytes
               3 Dir(s)  35,527,700,480 bytes free

In [8]:
df.to_csv('new_example.csv',index=True)

### HTML

In [9]:
tab1 = pd.read_html('https://en.wikipedia.org/wiki/World_population')

In [10]:
len(tab1)

29

In [11]:
tab1[0]

,Population,1,2,3,4,5,6,7,8,9,10
0,Year,1804,1930,1960,1974,1987,1999,2011,2022,2037,2057
1,Years elapsed,"200,000+",126,30,14,13,12,12,11,15,20

In [15]:
df1 = tab1[1]
df1.head(5)

,Region,2022 (percent),2030 (percent),2050 (percent)
0,Sub-Saharan Africa,"1,152 (14.51%)","1,401 (16.46%)","2,094 (21.62%)"
1,Northern Africa and Western Asia,549 (6.91%),617 (7.25%),771 (7.96%)
2,Central Asia and Southern Asia,"2,075 (26.13%)","2,248 (26.41%)","2,575 (26.58%)"
3,Eastern Asia and Southeastern Asia,"2,342 (29.49%)","2,372 (27.87%)","2,317 (23.92%)"
4,Europe and Northern America,"1,120 (14.10%)","1,129 (13.26%)","1,125 (11.61%)"

In [13]:
tab1[2]

    0                                                  1
0 NaN  Graphs are temporarily unavailable due to tech...

In [16]:
df1.to_csv('wiki.csv',index=False)

In [17]:
df1.to_html('wiki.html',index=False)

### Excel Files

In [23]:
pd.ExcelFile(r"C:\Users\shrey\Desktop\DAPP_Aug2023\DATA\my_excel_file.xlsx").sheet_names

['First_Sheet']

In [24]:
df = pd.read_excel(r"C:\Users\shrey\Desktop\DAPP_Aug2023\DATA\my_excel_file.xlsx",sheet_name=None)

In [27]:
type(df)

dict

In [29]:
df.keys()

dict_keys(['First_Sheet'])

In [31]:
df4= df['First_Sheet']
df4

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [32]:
df4.to_excel('new_excel_file.xlsx',sheet_name='new_sheet',index=True)

pip install sqlalchemy

### SQL

In [33]:
from sqlalchemy import create_engine

In [34]:
db1 = create_engine('sqlite:///:memory:')

In [35]:
df1

,Region,2022 (percent),2030 (percent),2050 (percent)
0,Sub-Saharan Africa,"1,152 (14.51%)","1,401 (16.46%)","2,094 (21.62%)"
1,Northern Africa and Western Asia,549 (6.91%),617 (7.25%),771 (7.96%)
2,Central Asia and Southern Asia,"2,075 (26.13%)","2,248 (26.41%)","2,575 (26.58%)"
3,Eastern Asia and Southeastern Asia,"2,342 (29.49%)","2,372 (27.87%)","2,317 (23.92%)"
4,Europe and Northern America,"1,120 (14.10%)","1,129 (13.26%)","1,125 (11.61%)"
5,Latin America and the Caribbean,658 (8.29%),695 (8.17%),749 (7.73%)
6,Australia and New Zealand,31 (0.39%),34 (0.40%),38 (0.39%)
7,Oceania,14 (0.18%),15 (0.18%),20 (0.21%)
8,World,7942,8512,9687

In [36]:
df1.to_sql(name='continents_pop', con=db1)

9

In [37]:
pd.read_sql(sql= 'continents_pop',con=db1)

,index,Region,2022 (percent),2030 (percent),2050 (percent)
0,0,Sub-Saharan Africa,"1,152 (14.51%)","1,401 (16.46%)","2,094 (21.62%)"
1,1,Northern Africa and Western Asia,549 (6.91%),617 (7.25%),771 (7.96%)
2,2,Central Asia and Southern Asia,"2,075 (26.13%)","2,248 (26.41%)","2,575 (26.58%)"
3,3,Eastern Asia and Southeastern Asia,"2,342 (29.49%)","2,372 (27.87%)","2,317 (23.92%)"
4,4,Europe and Northern America,"1,120 (14.10%)","1,129 (13.26%)","1,125 (11.61%)"
5,5,Latin America and the Caribbean,658 (8.29%),695 (8.17%),749 (7.73%)
6,6,Australia and New Zealand,31 (0.39%),34 (0.40%),38 (0.39%)
7,7,Oceania,14 (0.18%),15 (0.18%),20 (0.21%)
8,8,World,7942,8512,9687

In [38]:
pd.read_sql_query(sql='SELECT Region FROM continents_pop',con=db1)

                               Region
0                  Sub-Saharan Africa
1    Northern Africa and Western Asia
2      Central Asia and Southern Asia
3  Eastern Asia and Southeastern Asia
4         Europe and Northern America
5     Latin America and the Caribbean
6           Australia and New Zealand
7                             Oceania
8                               World